# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
   # conv1
  -  [-1, 1, ConvLayer, [16, 6, 2]]                                 # 0   2
    # layer1
  -  [-1, 1, InvertedResidual, [32, 1, 4]]                         # 1   2
    # layer2
  -  [-1, 1, InvertedResidual, [64, 2, 4]]                          # 2   4
  -  [-1, 2, InvertedResidual, [64, 1, 4]]                          # 3   4
    # layer3
  -  [-1, 1, InvertedResidual, [96, 2, 4]]                          # 4   8
  -  [-1, 1, MobileViTBlock, [144, 288, 2, 0, 0, 0, 2, 2]]        #  5   8
    # layer4
  -  [-1, 1, InvertedResidual, [128, 2, 4]]                        # 6   16
  -  [-1, 1, MobileViTBlock, [192, 384, 4, 0, 0, 0, 2, 2]]        # 7   16
    # layer5
  -  [-1, 1, InvertedResidual, [160, 2, 4]]                         # 8   32
  -  [-1, 1, MobileViTBlock, [240, 480, 3, 0, 0, 0, 2, 2]]       # 9   32
    # SPPF
  -  [ -1, 1, SPPF, [ 160, 5 ] ]                                    # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)